In [82]:
# !pip install SQLAlchemy

In [1]:
import pandas as pd
from sqlalchemy import create_engine

In [2]:
# MySQL connection string
conn_str = 'mysql+mysqlconnector://root:My$ql2024@localhost/revision_practice'

In [3]:
# import all the datasets
data = pd.read_excel("E:\iNeuron\MySQL\MySQL\REVISION_&_PRACTICE\Ebooks\hr_data.xlsx")

In [4]:
data.head()

  EMP_ID FIRST_NAME LAST_NAME  ...      CONTINENT SALARY EMP_RATING
0   E260        Roy   Collins  ...           ASIA   7000          3
1   E245       Nian      Zhen  ...           ASIA   6500          2
2   E620    Katrina     Allen  ...           ASIA   3000          1
3   E640    Jenifer    Jhones  ...  SOUTH AMERICA   2800          4
4   E403      Steve   Hoffman  ...  NORTH AMERICA   5000          3

[5 rows x 11 columns]

In [5]:
# Create a SQLAlchemy engine to connect to MySQL database
engine = create_engine(conn_str)

In [6]:
# Write the data from pandas DataFrame to MySQL database
data.to_sql(name='hr_data', con=engine, if_exists='replace', index=False)

16

### ALTERNATE METHOD to READ CSV FILES & WRITE DATA FROM PANDAS DF to MySQL DATABASE

The code for MySQL connection string and Create a SQLAlchemy engine to connect to MySQL database remains the same.

In [8]:
files = ['hr_data']

for file in files:
    df = pd.read_excel(f"E:\iNeuron\MySQL\MySQL\REVISION_&_PRACTICE\Ebooks\{file}.xlsx")
    df.to_sql(file, con=engine, if_exists='replace', index=False)

### From MySQL to Dataframe

In [ ]:
conn = mysql.connector.connect(
    host="localhost",
    user="root",
    password="password",
    database="restaurant_db"
)

query1 = "SELECT * FROM menu_items"
query2 = "SELECT * FROM order_details"
menu_items = pd.read_sql(query1, conn)
order_details = pd.read_sql(query2, conn)

conn.close()